main_titles = [
    'Номер',
    'Вид',
    'Бренд',
    'Маркування',
    'Колір',
    'Примітка',
    'Країна',
    'Розмір',
    'СМ',
    'Ціна',
    'Стара ціна',
    'Статус',
    'Стан',
    'Екстра примітка'
]
main_characters = [
    'A',
    'B',
    'C',
    'D',
    'E',
    'F',
    'G',
    'H',
    'I',
    'J',
    'K',
    'L',
    'M',
    'N'
]



# main_titles = [
#     'Номер',
#     'Вид',
#     'Бренд',
#     'Колір',
#     'Примітка',
#     'Країна',
#     'Розмір',
#     'СМ',
#     'Ціна',
#     'Стара ціна',
#     'Статус'
# ]
# main_characters = [
#     'A',
#     'B',
#     'C',
#     'D',
#     'E',
#     'F',
#     'G',
#     'H',
#     'I',
#     'J',
#     'K'
# ]

# * DONE
R_titles = [
    '',
    'Всього',
    'Виторг',
    '',
    '',
    'Уже продано',
    'Дійсний виторг',
    'Залишок товару',
    '',
    '',
    'К-сть проданих пар',
    'Залишилось пар',
]
S_data = [
    '',
    '=SUM(J2:J500)',  # 'ВСЯ СУМА',
    '=S2-Z4',  # 'ВИТОРГ СУМА',
    '',
    '',
    '=SUMIF(L2:L500, "Продано", J2:J500)',  # 'ПРОДАНО СУМА'
    '=S6-W2',  # ПРОДАНА СУМА - Собівартість(ПРОДАНОГО СУМА)
    '=S2-S6',  # ВСЯ СУМА - ПРОДАНО СУМА
    '',
    '',
    '=COUNTIF(L2:L500, "Продано")',  # 'КІЛЬКІСТЬ ПРОДАНОГО ЯКАСИЙСЬ МАКРОС'
    '=Z5-S11',  # КІЛЬКІСТЬ ПАР - КІЛЬКІСТЬ ПРОДАНОГО МАКРОС
]
# O_titles = [
#     'Всього',
#     'Виторг',
#     '',
#     ''
#     'Уже продано',
#     'Дійсний виторг',
#     'Залишок товару',
#     '',
#     '',
#     'К-сть проданих пар',
#     'Залишилось пар',
# ]
# Q_data = [
#     '=SUM(I2:I500)',  # 'ВСЯ СУМА',
#     '=Q1-Z4',  # 'ВИТОРГ СУМА',
#     '',
#     ''
#     '=SUMIF(K2:K500, "Продано", I2:I500)',  # 'ПРОДАНО СУМА'
#     '=Q4-W2',  # ПРОДАНА СУМА - Собівартість(ПРОДАНОГО СУМА)
#     '=Q1-Q4',  # ВСЯ СУМА - ПРОДАНО СУМА
#     '',
#     '',
#     '=COUNTIF(K2:K500, "Продано")',  # 'КІЛЬКІСТЬ ПРОДАНОГО ЯКАСИЙСЬ МАКРОС'
#     '=Z5-Q9',  # КІЛЬКІСТЬ ПАР - КІЛЬКІСТЬ ПРОДАНОГО МАКРОС
# ]
# * DONE

U_titles = [
    '',
    'Собівартість (закупочна ціна)',
    'Собівартість (по дійсній ціні)',
    'Різниця собівартостей'
]

S_titles = [
    '',
    'Собівартість (закупочна ціна)',
    'Собівартість (по дійсній ціні)',
    'Різниця собівартостей'
]
V_W_titles = [
    'За пару',
    'Продано',
]

V_data = [
    '=Z4/Z5',  # '(Z2+Z3) / КІЛЬКІСТЬ ПАР'
    '=S2/Z5',  # 'ВСЬОГО СУМА / КІЛЬКІСТЬ ПАР'
    # 'Собівартість (по дійсній ціні) - Собівартість (закупочна ціна)'
    '=V3-V2'
]
W_data = [
    # Собівартість (закупочна ціна) за пару * КІЛЬКІСТЬ ПРОДАНИХ ПАР
    '=V2*S11',
    # Собівартість (по дійсній ціні) за пару * КІЛЬКІСТЬ ПРОДАНИХ ПАР
    '=V3*S11',
    # Собівартість (по дійсній ціні) за пару * КІЛЬКІСТЬ ПРОДАНИХ ПАР - Собівартість (закупочна ціна) за пару * КІЛЬКІСТЬ ПРОДАНИХ ПАР
    '=W3-W2'
]
# V_data = [
#     '=Z4/Z5',  # '(Z2+Z3) / КІЛЬКІСТЬ ПАР'
#     '=Q1/Z5',  # 'ВСЬОГО СУМА / КІЛЬКІСТЬ ПАР'
#     # 'Собівартість (по дійсній ціні) - Собівартість (закупочна ціна)'
#     '=V3-V2'
# ]
# W_data = [
#     # Собівартість (закупочна ціна) за пару * КІЛЬКІСТЬ ПРОДАНИХ ПАР
#     '=V2*Q10',
#     # Собівартість (по дійсній ціні) за пару * КІЛЬКІСТЬ ПРОДАНИХ ПАР
#     '=V3*Q10',
#     # Собівартість (по дійсній ціні) за пару * КІЛЬКІСТЬ ПРОДАНИХ ПАР - Собівартість (закупочна ціна) за пару * КІЛЬКІСТЬ ПРОДАНИХ ПАР
#     '=W3-W2'
# ]

# * DONE
Y_titles = [
    'Дата завозу',
    'Сума',
    'Сума доставки',
    'Всього',
    'К-сть пар',
]
Z_data = [
    '',
    '',  # СУМА ЯКАСЬ',
    '',  # 'СУМА ДОСТАВКИ ЯКАСЬ',
    '=Z2+Z3',
    '=COUNTA(A2:A500)'
]

# * DONE